//===========================================
//
// 回復中UIメイン処理[recoveringUI.cpp]
// Author 佐藤根詩音
//
//===========================================
//*******************************************
// インクルードファイル
//*******************************************
#include "main.h"
#include "manager.h"
#include "recoveringUI.h"

//-------------------------------------------
// マクロ定義
//-------------------------------------------

//-------------------------------------------
// 静的メンバ変数宣言
//-------------------------------------------

//==============================
// コンストラクタ
//==============================
CRecoveringUI::CRecoveringUI() : CBillboard(CObject::TYPE_RECOVERINGUI, CObject::PRIORITY_PLAYER)
{
	// 全ての値をクリアする
}

//==============================
// デストラクタ
//==============================
CRecoveringUI::~CRecoveringUI()
{

}

//==============================
// 破片の初期化処理
//==============================
HRESULT CRecoveringUI::Init(void)
{
	if (FAILED(CBillboard::Init()))
	{ // 初期化処理に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	// 全ての値を初期化する

	// 値を返す
	return S_OK;
}

//========================================
// 破片の終了処理
//========================================
void CRecoveringUI::Uninit(void)
{
	// 終了処理
	CBillboard::Uninit();
}

//=====================================
// 破片の更新処理
//=====================================
void CRecoveringUI::Update(void)
{

}

//=====================================
// 破片の描画処理
//=====================================
void CRecoveringUI::Draw(void)
{
	// 描画処理
	CBillboard::Draw();
}

//=====================================
// 情報の設定処理
//=====================================
void CRecoveringUI::SetData(void/*基本Createと同じ引数を入れる*/)
{
	// 設定処理に便利なマクロ定義
	//NONE_D3DXVECTOR3					// 向きを傾けない時とかに使用する
	//NONE_SCALE						// 拡大率を変更しないときとかに使う
	// 情報の設定処理

	//==========================================================================
	// 2Dポリゴン
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//SetLength(引数無し);			// 長さ
	//SetAngle(引数無し);			// 方向
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// 3Dポリゴン
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// ビルボード
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetSize(サイズを入れる);		// サイズ
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// アニメーション系
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//SetLength(引数無し);			// 長さ
	//SetAngle(引数無し);			// 方向
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	// アニメーションの設定処理
	//SetAnim(カウントを入れる, パターン数を入れる);

	//// 頂点座標の設定処理
	//SetVertex();

	// テクスチャの設定(アニメーションバージョン)
	//SetVtxTextureAnim(アニメーションの総パターン数を入れる, 0);

	//==========================================================================
	// モデル
	//==========================================================================
	//SetPos(位置を入れる);					// 位置
	//SetPosOld(位置を入れる);				// 前回の位置
	//SetRot(向きを入れる);					// 向き
	//SetScale(拡大率を入れる);				// 拡大率
	//SetFileData(モデルの種類を入れる);	// モデルの情報
}

//=======================================
// 生成処理
//=======================================
CRecoveringUI* CRecoveringUI::Create(void/*引数を入れる*/)
{
	// ローカルオブジェクトを生成
	CRecoveringUI* pRecoveringUI = nullptr;	// サンプルのインスタンスを生成

	if (pRecoveringUI == nullptr)
	{ // オブジェクトが NULL の場合

		// インスタンスを生成
		pRecoveringUI = new CRecoveringUI;
	}
	else
	{ // オブジェクトが NULL じゃない場合

		// 停止
		assert(false);

		// NULL を返す
		return nullptr;
	}

	if (pRecoveringUI != nullptr)
	{ // オブジェクトが NULL じゃない場合

		// 初期化処理
		if (FAILED(pRecoveringUI->Init()))
		{ // 初期化に失敗した場合

			// 停止
			assert(false);

			// NULL を返す
			return nullptr;
		}

		// 情報の設定処理
		pRecoveringUI->SetData(/*引数*/);
	}
	else
	{ // オブジェクトが NULL の場合

		// 停止
		assert(false);

		// NULL を返す
		return nullptr;
	}

	// サンプルのポインタを返す
	return pRecoveringUI;
}